import React from "react"
import "./Dentistry.css"
import IntroductionOfFaculty from "../../components/FacultiesSections/IntroductionOfFaculty"

const Dentistry = () => {
  return (
    <div className="dentistry">
      {/* introduction of faculty */}
      <IntroductionOfFaculty
        facultyText1="پوهنحی ستوماتولوژی مؤسسه تحصیلات عالی هریوا در سال 1393 هجری شمسی تأسیس گردیده و متعهد به ارائه آموزش های علمی و عملی در بخش طب دندان با استفاده از تکنالوژی جدید و تقدیم کدر های متخصص و مسلکی به جامعه می باشد."
        facultyText2="در رأس پوهنحی ستوماتولوژی رئیس آن پوهنحی قرار دارد که به ریاست مؤسسه گزارش ده می باشد. تحت ریاست پوهنحی ستوماتولوژی بخش های معاونیت پوهنحی، مدیریت تدریس، مدیریت اجرائی، آمریت دیپارتمنت پاراکلینیک و آمریت دیپارتمنت کلینیک قرار دارد. در حال حاضر پوهنحی ستوماتولوژی مؤسسه تحصیلات عالی هریوا36 تن استاد دارد که از جمله یک تن آنها دوکتورا، 22 تن آنها ماستر/متخصص و 13 تن آنها لیسانس (پوهاند)می باشند. تعداد محصلین پوهنحی ستوماتولوژی مؤسسه در حال حاضر (1401 ه. ش) به 473تن  محصل میرسد."
      />
    </div>
  )
}

export default Dentistry
