import React from "react"
import './About.css'
import Footer from "../../components/Footer/Footer"

const About = () => {
  return (
    <div className="about">
      <div className="about_details">
        <h1>معرفی مؤسسه تحصیلات عالی هریوا</h1>
        <p>
          مؤسسه تحصیلات عالی هریوا یک نهاد علمی – تحصیلی خصوصی می باشد که در رأس
          آن ریاست عمومی مؤسسه و تحت آن شش بخش کلیدی، معاونیت علمی، معاونیت مالی
          و اداری، معاونیت امور محصلان، ریاست پوهنحی ستوماتولوژی، ریاست پوهنحی
          کمپیوتر ساینس و ریاست پوهنحی حقوق و علوم سیاسی قرار دارد. هر یک از این
          بخش ها مسؤل مدیریت، تهیه و ترتیب پلان، اجراأت، نظارت و ارزیابی تمام
          فعالیت های مربوطه بخش خویش بوده و مستقیماً به ریاست مؤسسه گزارش ده می
          باشند. هیأت امنأ مؤسسه تحصیلات عالی هریوا مشتمل بر رئیس و سه معاونین
          مؤسسه می باشد که تصامیم راهبردی و عمده توسط این هیأت گرفته می شود.
        </p>
        <p>
          یکی از رسالت های مهم و اساسی مؤسسه تحصیلات عالی خصوصی هریوا فراهم
          نمودن زمینه آموزش با کیفیت عالی از طریق تدریس معیاری، تربیه کدر های
          مسلکی، جذب ظرفیت های علمی جهت تولید دانش از طریق تألیف مقالات علمی و
          تدویر سمینار های علمی و تلاش در جهت کاربردی ساختن دانش روز از راه
          انجام تحقیقات علمی و شناسایی چالش های موجود جامعه و ارائه پیشنهاد ها
          برای رفع آنها می باشد. بناءً برای رسیدن به این امر مهم مؤسسه تحصیلات
          عالی هریوا همواره با برگزاری سمینار های علمی، ترتیب و تنظیم پلان های
          کاری، علمی و تحقیقاتی، انتخاب اساتید مجرب و ورزیده و تمام سعی و تلاش
          خویش را مبذول داشته است.
        </p>
        <p>
          موسسه تحصیلات عالی هریوا با داشتن صنوف مجهز، امکانات و محیط مناسب
          تحصیلی در واقع یکی از پیشروترین موسسات تحصیلات عالی در ارایه خدمات به
          محصلین خویش در حوزه غرب میباشد. در اختیار داشتن مالکیت تعمیر موسسه که
          در یکی از بهترین و مصئون ترین اماکن شهر هرات میباشد باعث اطمینان
          شهروندان گردیده و همه ساله تعداد کثیری از محصلین را جذب خویش مینماید.
          علاوتا وجود اساتید مجرب و متعهد در چوکات دیپارتمنت های موسسه و
          برخورداری از کدر اداری متخصص از دیگر عوامل است که محصلین را قادر ساخته
          تا نهایت استفاده را از زمان صرف شده در طول دوران تحصیلی شان در موسسه
          بنمایند.
        </p>
      </div>

      {/* Footer  */}
      <Footer />
    </div>
  )
}

export default About
