import React from "react"
import "./Low.css"
import IntroductionOfFaculty from "../../components/FacultiesSections/IntroductionOfFaculty"

const Low = () => {
  return (
    <div className="low">
      {/* introduction of faculty */}
      <IntroductionOfFaculty
        facultyText1="پوهنحی حقوق و علوم سیاسی مؤسسه تحصیلات عالی هریوا در سال 1394 هجری شمسی تأسیس گردیده و در جهت ترویج فرهنگ حاکمیت قانون و تربیه کدر های مسلکی از جمله حقوقدانان، سیاستمداران، قضات، حارنوالان، و وکلای مدافع فعالیت می کند. این پوهنحی متعهد به ارائه آموزش های حقوقی معیاری و با کیفیت مطابق نیاز های روز جامعه می باشد."
        facultyText2="در رأس پوهنحی حقوق و علوم سیاسی رئیس آن پوهنحی قرار دارد که به ریاست مؤسسه گزارش ده می باشد. تحت ریاست پوهنحی حقوق و علوم سیاسی بخش های مدیریت تدریس، آمریت دیپارتمنت اداری – دیپلوماسی، آمریت دیپارتمنت قضای – خارنوالی و آمریت کلینیک حقوقی قرار دارد. در حال حاضر پوهنحی حقوق و علوم سیاسی مؤسسه تحصیلات عالی هریوا 39 تن استاد دارد که از جمله یک تن آنها دوکتورا، 29 تن آنها ماستر و 9 تن آنها لیسانس می باشند. تعداد محصلین پوهنحی حقوق و علوم سیاسی مؤسسه در حال حاضر (1397 ه. ش) به 212 محصل میرسد."
      />
    </div>
  )
}

export default Low
